{"page_title": "MHS Digital Edition: Adams Papers", "title": "", "url": "http://www.masshist.org/publications/apde2/view?mode=p&id=AFC06p203", "text_before_table": "The Honble. John Adams Esq. to Cotton Tufts as His Attorney Enclosure: Account Date: 1785-08-10 Recipient: Tufts, Cotton Author: Adams, John Docno: ADMS-04-06-02-0082-0002 14 Oct., both below. 12 and AA are dated 2. Cotton Tufts' next extant letters to note 3, above. JA, 3 Aug., JQA to Independent Chronicle, 7 July. See also Continental Journal, 9 June. A list of all laws passed in the May-July session appeared in the Boston Gazette, 6 June, and in the Independent Chronicle, 2 June, in the 1. Gov. James Bowdoin's address, delivered on 31 May, was published in the RC (Adams Papers), with enclosed account. Letter endorsed: “Dr Tufts August”; account endorsed: “Dr Tufts's Account 1785.” 2 P.S. I shall write more fully to Mrs. Adams upon Your domestic Concerns. [signed] Cotton Tufts Master Charles has entered College. Mr. John has arriv'd at New York. I expect him dayly. In a few Days I shall probably draw upon You for £50 or 100£ as I apprehend the encreasing Expence", "text_after_table": "[dateline] Weymouth July 4. 1785 [signed] Errors Excepted Per Cotton Tufts Weym [outh]: July 21st. 1785. At the Request of the Honble. Cotton Tufts Esq. I have particularly gone over and examined the foregoing Account, and find it right cast and properly Vouched in all its Parts. [signed] Richard Cranch The content of notes that appeared on this page in the printed volume has been moved to the end of the preceding document. RC (Adams Papers), with enclosed account. Letter endorsed: “Dr Tufts August”; account endorsed: “Dr Tufts's Account 1785.” Docno: ADMS-04-06-02-0083 Author: Adams, Abigail Recipient: Adams, John Quincy Date: 1785-08-11 Abigail Adams to John Quincy Adams [dateline] London August 11th. 1785 Grosvenor Square [salute] My dear son I went from my own little writing room below stairs just now into your Pappas; where Mr. Storer was writing for him. Col. Smith having set of upon a Tour in order to see the Prussian Review which takes place upon the 20 of this Month, 1 Mr. Storer", "last_modified": ""}